#pragma once
/// ========== 基底クラス ========== ///
class IShape {

///-------------------------------------------/// 
/// メンバ関数
///-------------------------------------------///
public:

	/// <summary>
	/// 仮想デストラクタ
	/// </summary>
	virtual ~IShape() = default;

	/// <summary>
	/// 面積を求める
	/// </summary>
	virtual void Size();

	/// <summary>
	/// 値を表示する
	/// </summary>
	virtual void Draw();

///-------------------------------------------/// 
/// メンバ変数
///-------------------------------------------///
protected:
	
	// 面積
	float area_;
};