#pragma once
/// === 基底クラス === ///
class Payment {

///-------------------------------------------/// 
/// メンバ関数
///-------------------------------------------///
public:

	/// <summary>
	/// コンストラクタ
	/// </summary>
	Payment();

	/// <summary>
	/// デストラクタ
	/// </summary>
	~Payment();

	/// <summary>
	/// 支払い
	/// </summary>
	virtual void Pay();

///-------------------------------------------/// 
/// メンバ変数
///-------------------------------------------///
protected:

	// 支払い方法の名前
	const char* name;
};